if SERVER then
    local subText = {
        "Это история вашей смерти.",
        "Фаербол всегда ходит первый.",
        "Средство от всех проблем только одно - ФАЕРБОЛ!",
        "Вы жалкие пешки в руках ДМа.",
        "Живите в проклятом мире, который сами создали.",
        "Вы либо умрёте, либо будете на грани смерти.",
        "Готовьте запасных персонажей.",
        "Среди вас есть предатель и это ДМ.",
        "Нет смысла что-либо придумывать, ДМ всё равно пошлёт нахер.",
        "Объявлена неделя рака кубов.",
        "Плакать - это свободное действие.",
        "D20 в печень, никто не вечен.",
        "Монстры не опасны. Опасны ваши идеи.",
        "Этот компейн - эксперимент. Увидим, кто сломается первым.",
        "Если вам кажется, что всё плохо - подождите следующего хода.",
        "Что бы вы ни придумали - мир уже придумал, как вас за это наказать.",
        "Выход есть всегда. Шанс добраться до него - нет.",
        "Расслабьтесь. Вас убьёт не монстр. Вас убьёт ваш же план.",
        "Это не приключение. Это протокол утилизации персонажей.",
        'Добро пожаловать туда, где надежда получает штраф "−5".',
        "Смерть - не конец. Это просто новая форма разочарования.",
        "Помните: у монстров есть семья. У ДМа - нет.",
        "Каждое ваше решение, лишь дополнительный повод вас убить.",
        "Порог боли - это тоже характеристика. Проверку вы провалили.",
        "Если кажется, что хуже уже не будет - значит, вы ещё не кидали кубы.",
        "Вы не герои. Вы - статистика.",
        'Это не "начало приключения". Это - "титры в обратном порядке".',
        "Вы думаете, что ищете приключений? Нет, вы ищете свою могилу. Она уже вырыта.",
        "Удача - это редкий ресурс. Вы его уже потратили.",
        "Выживут сильнейшие. Ну или те, кто вовремя убежит.",
        "Если вам кажется, что это ловушка - вы правы. Если не кажется - всё гораздо хуже.",
        "Единственное что вы выбираете, это то как вы умрёте.",
        "Это не провал проверки. Это демонстрация вашего истинного потенциала.",
        "Ваш инвентарь - список того, что вы потеряете.",
        "Криты будут. Просто не у вас."
    }
    local TextUsed = {}
    local function refillTextUsed()
        TextUsed = table.Copy(subText)
    end

    util.AddNetworkString("DND_RequestStartSign")
    util.AddNetworkString("DND_AdventureStart")

    refillTextUsed()

    local function getRandomText()
        if #TextUsed == 0 then
            refillTextUsed()
        end
        local idx = math.random(1, #TextUsed)
        local text = TextUsed[idx]
        table.remove(TextUsed, idx)
        return text
    end

    function StartSigns()
        local chosenText = getRandomText()
        net.Start("DND_AdventureStart")
        net.WriteString(chosenText)
        net.Broadcast()
    end

    net.Receive("DND_RequestStartSign", function(len, ply)
        StartSigns()
    end)
end
